[{
  "company": "Disney Streaming",
  "link": "https://dmedmedia.disney.com/",
  "role": "Lead Software Engineer",
  "date": "Aug 2022 - Present",
  "location": "Remote",
  "description": "Member of Content Distribution & Origin team serving content for Disney+, Hulu, ESPN+, etc.",
  "description_bullets": [
    "Contribute to the implementation and deployment of the data plane and supporting software for the Disney Origin, Mid-Tier, and Edge appliances and CDNs",
    "Update Varnish HTTP cache VCL configurations and add Varnish Test Cases (VTC) for testing HTTP request behavior",
    "Expand CLI utilities to administer and maintain caching infrastructure",
    "Improve Server Maintenance feature to pull Varnish servers out of cluster without impacting users including coordination with Varnish, Apache Traffic Router/Monitor, internal monitoring/configuration management, and Bird/BGP",
    "Expand testing of Varnish and Server Maintenance into containers to improve test coverage before deploying changes",
    "Design and implement operational tooling for health monitoring, traffic engineering, and other critical functions",
    "Apply principled engineering practices including unit testing, integration testing, continuous integration"
  ]
},{
  "company": "VMware",
  "link": "https://www.vmware.com",
  "role": "Senior Site Reliability Engineer",
  "date": "Oct. 2019 - Aug. 2022",
  "location": "Remote",
  "description": "Maintained and managed testing lab for all of VMware Security Business Unit (Carbon Black)",
  "description_bullets": [
    "Helped spearhead effort to move entire lab across the country from Massachusetts to Washington State with almost no downtime or impact to users",
    "Maintained large vSphere lab environment serving hundreds of engineers and thousands of VMs per week",
    "Maintained core services for testing including multiple Jenkins servers, Gitlab, Artifactory, vSphere/vCenter, DNS/firewalls/networking, etc.",
    "Migrated existing services to on-prem Kubernetes solutions using Tanzu (TKG)",
    "Helped users debug complex pipelines and automated testing workflows, as well as handled all issues that occur within the lab",
    "Automated deployment of servers and services using Infrastructure as Code (IaC) and containers",
    "Automated common tasks and monitoring using scripts and CI/CD",
    "Automated deployment and management of servers with Puppet/Ansible",
    "Advocated for security across VMware and proactively looked for improvements and weaknesses",
    "Mentorerd and assisted junior engineers"
  ]
},{
  "company": "Carbon Black",
  "link": "https://www.carbonblack.com",
  "role": "Senior Software Development Engineer in Test",
  "date": "Aug. 2016 - Oct. 2019",
  "location": "Remote",
  "description": "Automation, continuous integration, QA testing",
  "description_bullets": [
    "Helped design and implement automated testing suite for multiple products across Windows/Linux/Mac using Python/pytest, Docker, vCenter, and Jenkins w/Groovy pipelines",
    "Automated existing manual test cases and test plans to free up manual tester time and provide more coverage",
    "Worked with Release Engineering to hook automation and testing into the build process",
    "Implemented Graylog (ELK) for log monitoring in test environments to monitor hard to find bugs and crashes",
    "Assisted with containerizing the product with Docker in order to deploy on-demand test environments",
    "Mentored existing engineers on best practices and provide code reviews",
    "Evangelized and promoted automation across the company and leadership",
    "Collaborated with developers on improving system quality and establishing efficient and thorough testing",
    "Assisted DevOps and Systems Engineering teams on creating test environments, test labs, and consult on technologies and products used",
    "Interviewed new hire candidates across roles"
  ]
},{
  "company": "Hudl",
  "link": "https://www.hudl.com",
  "role": "Quality Engineer",
  "date": "Sept. 2014 - Aug. 2016",
  "location": "Remote",
  "description": "Automation, continuous integration, QA testing",
  "description_bullets": [
    "Authored and maintained scalable and expandable automated testing framework in Python for Selenium (web) and Appium (mobile) testing, as well as HTTP/REST/GraphQL integration testing",
    "Added new automation, tests, and CI across many different areas of the product team and internal infrastructure, wherever needed",
    "Provided code reviews and assistance to other Quality Engineers and Analysts",
    "Helped maintain Hudl's AWS cloud infrastructure and participated in on-call rotation",
    "Documented limitations and continually pushed for improvements to infrastructure and processes to increase testing consistency",
    "Interviewed, graded projects, and helped hire dozens of candidates across all roles including interns, engineers, PMs, and VPs",
    "Co-lead \"Security Guild\", focused on security related issues at Hudl, and best practices",
    "Continually researched new technologies, testing frameworks, and libraries",
    "Improved and pushed bug fixes upstream to open source projects Hudl uses",
    "Mentored new employees"
  ]
},{
  "company": "Avere Systems",
  "link": "https://www.averesystems.com",
  "role": "Software QA Engineer",
  "date": "Feb. 2013 - Aug. 2014",
  "location": "Remote",
  "description": "Tested products and features to maintain quality and find bugs",
  "description_bullets": [
    "Responsible for writing software automation for testing and debugging Avere products",
    "Worked with developers finding, fixing, and verifying product bugs and solutions",
    "Discovered weaknesses or enhancements that make the product better or easier to use",
    "Wrote and improved existing test plans and documentation",
    "Verified new product features are well tested and working properly before shipping",
    "Implemented Selenium web testing framework for cross-browser automation",
    "Test focus areas: advanced networking, installation/upgrade, management and configuration, and GUI"
  ]
},{
  "company": "Avere Systems",
  "link": "https://www.averesystems.com",
  "role": "Customer Experience Engineer",
  "date": "Jul. 2011 - Feb. 2013",
  "location": "Pittsburgh, PA",
  "description": "Member of team of versatile support engineers handling all customer and internal support requests ",
  "description_bullets": [
    "Required to be resourceful and efficient in order to solve issues with minimal training or documentation",
    "Utilizing a large variety of skill sets to take each issue from initial troubleshooting to resolution including log/statistic analysis, internal troubleshooting commands, OS debugging, packet capture analysis, internal process tracing and debugging, as well as engaging engineers when necessary",
    "Required to discover root cause of each issue, including isolation to outside problems not related to the Avere product such as switch or routing problems, network bottlenecks, hardware failures, back-end storage communication, etc.",
    "Direct customer interaction via phone, email, and desktop sharing resolving a wide range of issues from initial configuration, to performance analysis, to complex network/storage/product troubleshooting",
    "Required to document, collect data, and reproduce issues in house if possible, providing engineers with as much information as possible to fix software issues",
    "Providing feedback on product shortcomings, product enhancements, and customer pains",
    "Interfacing with all aspects of company including sales, engineers, marketing, customers, devops, etc.",
    "Trained new engineers as well as interviewing potential new candidates",
    "Wrote tools and scripts for customer configuration, data analysis, and visualization",
    "Documented common problems and solutions",
    "Participated in weekly 24x7 on-call rotation"
  ]
},{
  "company": "LocalNet Corp.",
  "link": "https://www.localnet.com",
  "role": "Linux Systems Administrator",
  "date": "Feb. 2009 - Jul. 2011",
  "location": "Buffalo, NY",
  "description": "Member of small team of administrators responsible for 300+ server infrastructure ",
  "description_bullets": [
    "One of only two local admins who were responsible for all server hardware installation, troubleshooting and maintenance including being trusted with full security access to all buildings, hardware, and software",
    "Regularly on-call in rotation with other admins, as well as \"hands-on\" on-call for remote admins when hardware needs physical interaction or maintenance",
    "Performed complete power audit of server infrastructure and found that power could be reduced between $13-15k per year by virtualizing physical servers",
    "Created VMware ESXi infrastructure and began complete physical-to-virtual conversion of entire server infrastructure, even manually converting outdated servers that rely on unsupported hardware",
    "Greatly improved server infrastructure by instituting RAID on core non-load-balanced servers as well as helped roll out completely customized Nagios monitoring system",
    "Upgraded customer database from an outdated version of MySQL to new updated hardware with RAID w/BBWC, replication, optimized configuration settings, and appropriate tables converted to InnoDB from MyISAM with performance improvements of 500% in some cases, all with less than 3 hours of downtime",
    "Set up new load-balanced webmail front end and customized distributed email system serving over 250,000 customers in order to institute server side email filtering, without any disruption to email delivery",
    "Inventoried entire server infrastructure using open source software creating complete audit of hardware and software on all servers",
    "Designed server hardware for digital signage distributed enterprise server product",
    "Set up LTSP environment for the company’s call center, re-using old Pentium III desktop PCs distributed across multiple servers saving the company thousands of dollars on machines for tech agents, and giving complete control over what they can do and access",
    "Designated “hardware guy” for all equipment, have built and troubleshot hundreds of servers in a completely heterogeneous environment from many different vendors",
    "Responsible for documenting all completed projects as well as interviewing/training of new admins",
    "Daily monitoring and support of email systems, distributed hosting environments, and disk/tape backups",
    "Kept servers patched for vulnerabilities and compliant with TrustKeeper/Trustwave auditing",
    "Dozens of upgrade/security maintenance windows performed during off hours, usually 2-6am, many times involving coordination with other departments"
  ]
},{
  "company": "Ingram Micro",
  "link": "https://www.ingrammicro.com",
  "role": "Technical Support Engineer II",
  "date": "Sept. 2006 - Feb. 2009",
  "location": "Buffalo, NY",
  "description_bullets": [
    "Pre-sales infrastructure and design consultation with worldwide VAR accounts to design and configure solutions for business needs in the areas of networking, wireless, IP telephony, servers/blades, PCs, fibre channel storage, load balancing, and others",
    "Post-sales configuration and troubleshooting of Cisco networks including routers, switches/chassis, voice gateways, firewalls, IP Telephony and Unified Communications, as well as Linux software deployments",
    "Maintenance, configuration, and redesign of a fully functional internal enterprise network for hundreds of users including servers, tape libraries and SAN",
    "Level 2 technician with responsibility of full knowledge of the supported products including escalations from level 1 technicians",
    "Training for new technicians, licensing specialists, and re-sellers in person or via WebEx on all areas of technology including networking, systems/servers, storage, and power",
    "Proactively discovering gaps in knowledge of the team and resolving via team or 1-on-1 training sessions",
    "Provided feedback in multiple areas of Ingram Micro's business directly resulting in improvement of business operations, expenses, efficiency, and reliability including in house applications, remotely located servers and networking equipment",
    "Leader in Ingram Micro's World Class Tech Support which is renowned worldwide as the best in distribution including consistently being voted #1 by CRN magazine and CompTIA; excelling in consistency, accuracy, and prompt response",
    "Leader of the F5 Networks team including off-site training on BIG-IP from F5 in NYC",
    "Installation and configuration of Windows Active Directory/IIS/Exchange servers"
  ]
},{
  "company": "Cyber Source",
  "role": "Admin/System Builder/Web Developer",
  "date": "Jan. 2002 - Sept. 2006",
  "location": "Buffalo, NY",
  "description_bullets": [
    "Linux systems administrator including configuration and regular maintenance of production e-mail, web, and backup servers",
    "Website authoring and maintaining",
    "Linux desktop installer including configuration of end user ready Linux machines for home or office use including VMware Workstation, Server, and Player",
    "Configuration and installation of medium-sized office networks including LAN, WAN, and on-site calls",
    "Building complete systems/servers unsupervised",
    "Repairing and troubleshooting software and hardware errors of desktops/laptops"
  ]
}]
