[{
    "name": "Mark Schmitt",
    "role": "Director of SaaS Operations, Brainshark",
    "description": "Jesse has that rare combination of attributes that make him a delight to have on a team. He is a consummate professional and consistently reliable and conscientious; he is highly skilled in a number of technologies and always adding to his tool belt as a continuous learner; AND he is easy going and just a generally very pleasant human being to be around. If given the opportunity I would hire Jesse without hesitation and very much hope we can work together again someday when the stars align for that. You will not regret a decision to hire him. He's driven and delivers value with whatever he sets his professional mind to accomplishing."
},{
    "name": "Issam Gharios",
    "role": "VP of Software, HighRes Biosolutions",
    "description": "Jesse joined my team at Carbon Black at an early stage of building a complex automation environment. He got up to speed fast and contributed to both implementation and architecture. Jesse is highly regarded by his teammates and is a great addition to any team. Our automation framework needed to run in a highly secure environment and Jesse was part of the team that made it happen. I highly recommend Jesse, he will elevate any team's technical ability."
},{
    "name": "Matt Cummings",
    "role": "Staff Engineer, Panther Labs",
    "description": "I was the first engineer to interview Jesse when he applied for a role at Carbon Black. After speaking with him, I told my manager \"You must hire this guy\" and we did. As it turned out, Jesse was even better than I had expected. Jesse is meticulous and hard working but also collaborative and friendly. I could distill this down to one word, he's _solid_. He is an exceptional engineer and one of the best Python developers I've ever worked with. I would happily work with Jesse again, in any capacity."
},{
    "name": "Dave Garbus",
    "role": "SRE/DevOps Consultant",
    "description": "Jesse is one of the most talented and passionate engineers I have come across throughout my career. His ability to quickly debug and troubleshoot problems, architect elegant solutions, and patiently mentor his peers makes Jesse a rare gem in the field. I haven’t worked with him for a few years now, but we still keep in touch and share new ideas and things we’ve learned along the way. I wouldn’t hesitate to work with Jesse again, and have certainly tried a number of times to no avail!"
},{
    "name": "Ray Williams",
    "role": "ScrumMaster, Red Hat",
    "description": "Jesse is an essential piece of any team he is on. He is excellent at providing direction, feedback, and work quality. Some of my favorite interactions with Jesse were through the code review process, and utilizing that to help grow a culture of quality reviews, and using those reviews as a great learning opportunity. Aside from that, Jesse has great insight on direction and focus for products and roadmaps. Easily one of my favorite coworkers to date."
},{
    "name": "Joshua Moravec",
    "role": "SDET, Meta",
    "description": "It is always a pleasure to work with Jesse on any project. I've been fortunate enough to have worked with him in two different companies. He has a wide breadth and depth of knowledge around Python, test automation, system administration, vSphere, and many others. He is usually the first person I go to for a review of my code, as he will suggest and guide anyone who asks to get the best code possible merged."
}]
